[
    {
        "image": "/images/high_school_dance.JPG",
        "content": "Sohel and Fabliha met in Forest Hills High School, when he first came to America as a foreign exchange student. This photo is a from a school homecoming dance that they attended together.",
        "date": "November 2014"
    },
    {
        "image": "/images/bowling_homie_date.JPG",
        "content": "Sohel and Fabliha kept in touch over the years and met up whenever Sohel would visit America and Fabliha would visit Bangladesh. This photo was taken during Sohel's visit to America as a tourist. She kicked Sohel's ass in bowling that day.",
        "date": "January 2020"
    },
    {
        "image": "/images/mirror_pic1.JPG",
        "content": "Sohel came back for a master's degree and started hanging out with her more often. They'd always been good friends, but this time they noticed an undeniable spark growing. A close friendship turned into a relationship.",
        "date": "2023"
    },
    {
        "image": "/images/bryant_park_first.JPG",
        "content": "Visit to the 2023 Winter Village at Bryant Park, where they first professed their love for each other.",
        "date": "December 2023"
    },
    {
        "image": "/images/sohel_grad_photo.JPG",
        "content": "Sohel graduated his master's program and celebrated the day with Fabliha after the official ceremony.",
        "date": "May 2024"
    },
    {
        "image": "/images/mirror_pic2.JPG",
        "content": "Sohel and Fabliha continued having an amazing time with each other. Dinners, broadway shows, parties, adventures, and so much more. They fell for each other more and more with each day.",
        "date": "October 2024"
    },
    {
        "image": "/images/proposal_pic.JPG",
        "content": "Sohel decided to propose to Fabliha at the same spot where they'd first expressed their love for each other. She was under the impression that they were doing a photoshoot with a close friend of Sohel's. When they got there, they 'randomly' ran into Fabliha's best friend (who Sohel had secretly onboarded in the surprise). Once the four of them got to a preplanned spot in front of the beautiful Christmas tree, Sohel got down on one knee and proposed! The crowd gathered around them erupted in cheers when she said yes.",
        "date": "January 2025"
    },
    {
        "image": "/images/great_gatsby.JPG",
        "content": "Sohel and Fabliha both love theater, especially Broadway. This particular show was very nostalgic to them because they'd read 'The Great Gatsby' together in their English class in Forest Hills High School.",
        "date": "February 2025"
    },
    {
        "image": "/images/marriage_picture.JPG",
        "content": "Sohel and Fabliha performed a small ceremony to take the first steps of married life together before hosting bigger functions later in the year.",
        "date": "March 2025"
    },
    {
        "image": "/images/beacon_dinner.JPEG",
        "content": "Before taking the time to plan an international honeymoon trip, Sohel and Fabliha decided to do a shorter trip closer to home. Sohel chose upstate NY for their weekend getaway, because he had very fond memories of the picturesque Hudson river towns there. One of the towns they traveled to was Beacon; they had a great time exploring it and having dinner at a hotel/restaurant near the waterfalls.",
        "date": "April 2025"
    },
    {
        "image": "/images/party.JPG",
        "content": "They have been loving married life. They consider themselves blessed to have found love through friendship, since they essentially feel like best friends who also love each other romantically. They can't wait to have countless new adventures together!",
        "date": "July 2025"
    }
]